#### Terraform Plan 📋 `prod/monitoring`

**Summary:** 09:08:20.264 STDOUT terraform: Plan: 2 to add, 0 to change, 0 to destroy.

<details><summary>Show Plan Details</summary>

```terraform
09:08:20.262 STDOUT terraform:   # helm_release.victoria_metrics_k8s_stack will be created
09:08:20.262 STDOUT terraform:   + resource "helm_release" "victoria_metrics_k8s_stack" {
09:08:20.262 STDOUT terraform:       + atomic                     = true
09:08:20.262 STDOUT terraform:       + chart                      = "victoria-metrics-k8s-stack"
09:08:20.262 STDOUT terraform:       + cleanup_on_fail            = false
09:08:20.262 STDOUT terraform:       + create_namespace           = false
09:08:20.262 STDOUT terraform:       + dependency_update          = false
09:08:20.262 STDOUT terraform:       + disable_crd_hooks          = false
09:08:20.262 STDOUT terraform:       + disable_openapi_validation = false
09:08:20.262 STDOUT terraform:       + disable_webhooks           = false
09:08:20.262 STDOUT terraform:       + force_update               = false
09:08:20.262 STDOUT terraform:       + id                         = (known after apply)
09:08:20.262 STDOUT terraform:       + lint                       = false
09:08:20.262 STDOUT terraform:       + max_history                = 0
09:08:20.262 STDOUT terraform:       + metadata                   = (known after apply)
09:08:20.262 STDOUT terraform:       + name                       = "vm-stack"
09:08:20.262 STDOUT terraform:       + namespace                  = "monitoring"
09:08:20.262 STDOUT terraform:       + pass_credentials           = false
09:08:20.262 STDOUT terraform:       + recreate_pods              = false
09:08:20.262 STDOUT terraform:       + render_subchart_notes      = true
09:08:20.262 STDOUT terraform:       + replace                    = true
09:08:20.262 STDOUT terraform:       + repository                 = "https://victoriametrics.github.io/helm-charts/"
09:08:20.262 STDOUT terraform:       + reset_values               = false
09:08:20.262 STDOUT terraform:       + reuse_values               = false
09:08:20.263 STDOUT terraform:       + set_wo                     = (write-only attribute)
09:08:20.263 STDOUT terraform:       + skip_crds                  = false
09:08:20.263 STDOUT terraform:       + status                     = "deployed"
09:08:20.263 STDOUT terraform:       + take_ownership             = false
09:08:20.263 STDOUT terraform:       + timeout                    = 900
09:08:20.263 STDOUT terraform:       + upgrade_install            = false
09:08:20.263 STDOUT terraform:       + values                     = [
09:08:20.263 STDOUT terraform:           + <<-EOT
09:08:20.263 STDOUT terraform:                 victoria-metrics-operator:
09:08:20.263 STDOUT terraform:                   enabled: true
09:08:20.263 STDOUT terraform:                 
09:08:20.263 STDOUT terraform:                 # Single-node configuration for cost efficiency
09:08:20.263 STDOUT terraform:                 vmsingle:
09:08:20.263 STDOUT terraform:                   enabled: true
09:08:20.263 STDOUT terraform:                   spec:
09:08:20.263 STDOUT terraform:                     retentionPeriod: 30d
09:08:20.263 STDOUT terraform:                     storage:
09:08:20.263 STDOUT terraform:                       storageClassName: do-block-storage
09:08:20.263 STDOUT terraform:                       accessModes:
09:08:20.263 STDOUT terraform:                         - ReadWriteOnce
09:08:20.263 STDOUT terraform:                       resources:
09:08:20.263 STDOUT terraform:                         requests:
09:08:20.263 STDOUT terraform:                           storage: "10Gi"
09:08:20.263 STDOUT terraform:                 
09:08:20.263 STDOUT terraform:                 # Disable cluster version by default
09:08:20.263 STDOUT terraform:                 vmcluster:
09:08:20.263 STDOUT terraform:                   enabled: false
09:08:20.263 STDOUT terraform:                 
09:08:20.263 STDOUT terraform:                 vmagent:
09:08:20.263 STDOUT terraform:                   enabled: true
09:08:20.263 STDOUT terraform:                 
09:08:20.263 STDOUT terraform:                 vmalert:
09:08:20.263 STDOUT terraform:                   enabled: true
09:08:20.264 STDOUT terraform:                 
09:08:20.264 STDOUT terraform:                 grafana:
09:08:20.264 STDOUT terraform:                   enabled: true
09:08:20.264 STDOUT terraform:                   ingress:
09:08:20.264 STDOUT terraform:                     enabled: false
09:08:20.264 STDOUT terraform:                   persistence:
09:08:20.264 STDOUT terraform:                     enabled: true
09:08:20.264 STDOUT terraform:                     storageClassName: do-block-storage
09:08:20.264 STDOUT terraform:                     size: "2Gi"
09:08:20.264 STDOUT terraform:                 
09:08:20.264 STDOUT terraform:                 # Setup easy access for initial testing
09:08:20.264 STDOUT terraform:                 serviceAccount:
09:08:20.264 STDOUT terraform:                   create: true
09:08:20.264 STDOUT terraform:             EOT,
09:08:20.264 STDOUT terraform:         ]
09:08:20.264 STDOUT terraform:       + verify                     = false
09:08:20.264 STDOUT terraform:       + version                    = "0.72.4"
09:08:20.264 STDOUT terraform:       + wait                       = true
09:08:20.264 STDOUT terraform:       + wait_for_jobs              = false
09:08:20.264 STDOUT terraform:     }
09:08:20.264 STDOUT terraform:   # kubernetes_namespace_v1.monitoring will be created
09:08:20.264 STDOUT terraform:   + resource "kubernetes_namespace_v1" "monitoring" {
09:08:20.264 STDOUT terraform:       + id                               = (known after apply)
09:08:20.264 STDOUT terraform:       + wait_for_default_service_account = false
09:08:20.264 STDOUT terraform:       + metadata {
09:08:20.264 STDOUT terraform:           + generation       = (known after apply)
09:08:20.264 STDOUT terraform:           + labels           = {
09:08:20.264 STDOUT terraform:               + "name" = "monitoring"
09:08:20.264 STDOUT terraform:             }
09:08:20.264 STDOUT terraform:           + name             = "monitoring"
09:08:20.264 STDOUT terraform:           + resource_version = (known after apply)
09:08:20.264 STDOUT terraform:           + uid              = (known after apply)
09:08:20.264 STDOUT terraform:         }
09:08:20.264 STDOUT terraform:     }
09:08:20.264 STDOUT terraform: Plan: 2 to add, 0 to change, 0 to destroy.
09:08:20.265 STDOUT terraform: Changes to Outputs:
09:08:20.265 STDOUT terraform:   + helm_release_name   = "vm-stack"
09:08:20.265 STDOUT terraform:   + helm_release_status = "deployed"
09:08:20.265 STDOUT terraform:   + namespace           = "monitoring"
09:08:20.332 STDOUT terraform: ─────────────────────────────────────────────────────────────────────────────
09:08:20.332 STDOUT terraform: Saved the plan to: tfplan
09:08:20.332 STDOUT terraform: To perform exactly these actions, run the following command to apply:
09:08:20.332 STDOUT terraform:     terraform apply "tfplan"
```

</details>

*Pusher: @krukmaksym, Action: `pull_request`, Workflow: `Terraform PR Validation`*